In [1]:
from sqlalchemy import create_engine, engine

# Replace 'root', 'Chennai@1234', 'localhost', '3306', and 'moviesdb' with your actual values
username = 'root'
password = 'Chennai@1234'
host = 'localhost'
port = '3306'
database = 'moviesdb'

# Create SQLAlchemy engine with typed URL
connection_url = engine.url.URL(
    drivername='mysql+pymysql',
    username=username,
    password=password,
    host=host,
    port=port,
    database=database,
)

engine = create_engine(connection_url)

/var/folders/w5/y4zxnb0130zgls3vnryxcytr0000gn/T/ipykernel_2293/1606722510.py:11: SADeprecationWarning: Calling URL() directly is deprecated and will be disabled in a future release.  The public constructor for URL is now the URL.create() method.
  connection_url = engine.url.URL(

In [2]:
selectquery="select * from actors"

In [4]:
import pandas as pd

In [5]:
data = pd.read_sql(selectquery, engine)

In [6]:
data

    actor_id                  name  birth_year
0         50                  Yash        1986
1         51           Sanjay Dutt        1959
2         52  Benedict Cumberbatch        1976
3         53       Elizabeth Olsen        1989
4         54       Chris Hemsworth        1983
..       ...                   ...         ...
62       166       Tommy Lee Jones        1946
63       167        Sebastian Stan        1982
64       168           Anil Kapoor        1956
65       169     Sidharth Malhotra        1985
66       170          Kiara Advani        1991

[67 rows x 3 columns]